##  1.0 Importando bibliotecas

In [4]:
import pandas as pd

## 2.0 Carregando os dados

In [11]:
imoveis = 'https://raw.githubusercontent.com/alura-cursos/pandas-conhecendo-a-biblioteca/main/base-de-dados/aluguel.csv'
df_raw = pd.read_csv(imoveis, sep=';')

df_raw.head()

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200.0,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
4,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN

In [12]:
df_raw.tail()

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
32955,Quitinete,Centro,0,0,0,27,800.0,350.0,25.0
32956,Apartamento,Jacarepaguá,3,1,2,78,1800.0,800.0,40.0
32957,Apartamento,São Francisco Xavier,2,1,0,48,1400.0,509.0,37.0
32958,Apartamento,Leblon,2,0,0,70,3000.0,760.0,NaN
32959,Conjunto Comercial/Sala,Centro,0,0,0,250,6500.0,4206.0,1109.0

In [13]:
type(df_raw)

pandas.core.frame.DataFrame

### 3.0 Caracteristicas Gerais:

In [22]:
# Quantitade de Linhas e Colunas
print(f'Quantidade de linhas: {df_raw.shape[0]} \nQuantidade de colunas: {df_raw.shape[1]}')

print('--'*50)
# Colunas da base de dados
print(list(df_raw.columns))

Quantidade de linhas: 32960
Quantidade de colunas: 9
----------------------------------------------------------------------------------------------------
['Tipo', 'Bairro', 'Quartos', 'Vagas', 'Suites', 'Area', 'Valor', 'Condominio', 'IPTU']

In [25]:
# Explorar diferentes colunas existentes
df_raw.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32960 entries, 0 to 32959
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Tipo        32960 non-null  object
 1   Bairro      32960 non-null  object
 2   Quartos     32960 non-null  int64
 3   Vagas       32960 non-null  int64
 4   Suites      32960 non-null  int64
 5   Area        32960 non-null  int64
 6   Valor       32943 non-null  float64
 7   Condominio  28867 non-null  float64
 8   IPTU        22723 non-null  float64
dtypes: float64(3), int64(4), object(2)
memory usage: 2.3+ MB

In [31]:
# Verificar os tipos de dados de cada coluna

## Dados Object (Strings)

df_raw[['Tipo','Bairro']]

                          Tipo                Bairro
0                    Quitinete            Copacabana
1                         Casa       Jardim Botânico
2      Conjunto Comercial/Sala       Barra da Tijuca
3                  Apartamento                Centro
4                  Apartamento          Higienópolis
...                        ...                   ...
32955                Quitinete                Centro
32956              Apartamento           Jacarepaguá
32957              Apartamento  São Francisco Xavier
32958              Apartamento                Leblon
32959  Conjunto Comercial/Sala                Centro

[32960 rows x 2 columns]

In [32]:
# Dados Int64 (Inteiros)
df_raw[['Quartos', 'Vagas','Suites','Area']]

       Quartos  Vagas  Suites  Area
0            1      0       0    40
1            2      0       1   100
2            0      4       0   150
3            1      0       0    15
4            1      0       0    48
...        ...    ...     ...   ...
32955        0      0       0    27
32956        3      1       2    78
32957        2      1       0    48
32958        2      0       0    70
32959        0      0       0   250

[32960 rows x 4 columns]

In [33]:
# Dados Float64 (Flutuantes)
df_raw[['Valor', 'Condominio','IPTU']]

        Valor  Condominio    IPTU
0      1700.0       500.0    60.0
1      7000.0         NaN     NaN
2      5200.0      4020.0  1111.0
3       800.0       390.0    20.0
4       800.0       230.0     NaN
...       ...         ...     ...
32955   800.0       350.0    25.0
32956  1800.0       800.0    40.0
32957  1400.0       509.0    37.0
32958  3000.0       760.0     NaN
32959  6500.0      4206.0  1109.0

[32960 rows x 3 columns]